Revit 2020 API
Mesh Members
The Mesh type exposes the following members.
Methods
Name | Description
Dispose
Causes the object to release immediately any resources it may be utilizing.
 (Inherited from APIObject.)
Equals
 Determines whether the specified Object is equal to the current Object.
 (Inherited from GeometryObject.)
GetHashCode
 Gets the integer value of the geometry object as hash code
 (Inherited from GeometryObject.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
GraphicsStyleId
The ElementId of the GeometryObject's GraphicsStyle
 (Inherited from GeometryObject.)
IsElementGeometry
Indicates whether this geometry is obtained directly from an Element.
 (Inherited from GeometryObject.)
IsReadOnly
Identifies if the object is read-only or modifiable.
 (Inherited from APIObject.)
MaterialElementId
Element ID of the material from which this mesh is composed.
NumTriangles
The number of triangles that the mesh contains.
Transformed
Transforms this mesh and returns the result.
Triangle
Retrieves a specific triangle.
Vertices
Retrieves all vertices used to define this mesh. Intended for indexed access.
Visibility
The visibility.
 (Inherited from GeometryObject.)
See Also
Mesh Class
Autodesk.Revit.DB Namespace